/* Домашнее задание 12.2 Написать делегат, с помощью которого реализуется сортировка
книг. Книга представляет собой класс с полями Название, Автор, Издательство и
конструктором. Создать класс, являющийся контейнером для множества книг (массив книг).
В этом классе предусмотреть метод сортировки книг. Критерий сортировки определяется
экземпляром делегата, который передается методу в качестве параметра. Каждый экземпляр
делегата должен сравнивать книги по какому-то одному полю: названию, автору,
издательству. */
namespace LibrarySystem
{
    public class Book
    {
        public string Title { get; }
        public string Author { get; }
        public string Publisher { get; }
        public Book(string title, string author, string publisher)
        {
            Title = title;
            Author = author;
            Publisher = publisher;
        }
    }
}
